########################################################################
## R에 있는 상수함수
########################################################################

letters # 알파벳 소문자
LETTERS # 알파벳 대문자
month.abb # 월이름 약어
month.name # 월이름 풀네임
pi # 원주율

########################################################################
length(letters); nrow(letters); NROW(letters) # 갯수확인
length(LETTERS); nrow(LETTERS); NROW(LETTERS) # 갯수확인

str(letters) # 구조확인
str(LETTERS) # 구조확인

letters[1:5] # 일부 소문자 추출
LETTERS[3:7] # 일부 대문자 추출

sample(letters[1:5], 10, replace = TRUE) # 무작위 소문자 복원 추출
sample(LETTERS[1:20], 10, replace = FALSE) # 무작위 대문자 비복원 추출

########################################################################
## 알파벳 상수를 이용한 무작위 ID만들기
sample(letters, 10, replace = TRUE) # 무작위 10개 소문자 복원 추출
sample(100:999, 10) # 무작위 100~999 중 10개 숫자 비복원 추출

id1 <- sample(letters, 10, replace = TRUE) # 무작위 10개 소문자 복원 추출
id2 <- sample(100:999, 10) # 무작위 100~999 중 10개 숫자 비복원 추출

paste(id1, id2, sep="") # 영문명과 숫자를 결합한 무작위 10개 ID생성

### End of Code ########################################################